def task_1(two_dim_words):
    """
        Здесь должен быть ваш код.
        Переменная two_dim_words - ваш двумерный список.
        Заполнять список значениями не нужно.
        Финальное значение должно быть помещено в переменную sorted_words.
        """

    return sorted_words


def task_3(numbers):
    """
        Здесь должен быть ваш код.
        Переменная numbers - ваша строка чисел.
        Финальное значение должно быть помещено в переменную dict_min.
        """

    return dict_min


def task_4_1(words):
    """
        Здесь должен быть ваш код.
        Переменная words - ваш кортеж слов из задания.
        Финальное значение должно быть помещено в переменную res.
        """

    return res


def task_4_2(words):  # можно сделать тесты
    """
        Здесь должен быть ваш код.
        Переменная words - ваш кортеж слов из задания.
        Финальное значение должно быть помещено в переменную res.
        """

    return res


def task_4_3(words):
    """
        Здесь должен быть ваш код.
        Переменная words - ваш кортеж слов из задания.
        Финальное значение должно быть помещено в переменную res.
        """

    return res


def task_5(lst1, lst2):
    lst1 = [4, 7, 3, 8, 5]
    lst2 = [1, 2, 66, 4, 35]
    list_m1 = set(lst1)
    list_m2 = set(lst2)
    a = list_m1.difference(list_m2)
    diff = sorted(a)
    return diff


def task_6(lst):
    '''lst = [4, 55, 66753, 45754, 2353, 5554, 54, 55, 3, 7, 8, 9, 0, 2, 1]
    res = tuple(sorted(lst, reverse=True))'''
    return res
#пока не готово

